notes/org/emacs/org_element_api.org
#+TITLE: Org Element Api
#+SETUPFILE: ../../setup.org

#+AUTHOR: MRCAT

Good doc here: https://orgmode.org/worg/dev/org-element-api.html

* Local Parsing

  Local parsing gives information about the element at point. Local parsing
  gives you information, but you cannot alter the structure of the AST.

  Two functions you can use:

  1. =org-element-at-point=
  2. =org-element-context=

** org-element-at-point

   #+begin_src emacs-lisp
     (pp (org-element-at-point))
   #+end_src

   #+RESULTS:
   : (src-block
   :  (:language "emacs-lisp" :switches nil :parameters nil :begin 399 :end 472 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "     (pp (org-element-at-point))\n" :post-blank 1 :post-affiliated 399 :parent nil))

   #+begin_src emacs-lisp
     (pp (save-excursion
        (goto-char (point-min))
        (org-element-at-point)))
   #+end_src

   #+RESULTS:
   : (keyword
   :  (:key "TITLE" :value "Org Element Api" :begin 1 :end 26 :post-blank 0 :post-affiliated 1 :parent nil))

** org-element-context

   #+begin_src emacs-lisp
     (org-element-context)
   #+end_src

   #+RESULTS:
   | src-block | (:language emacs-lisp :switches nil :parameters nil :begin 958 :end 1025 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value      (org-element-context) |

   #+begin_src emacs-lisp
     (save-excursion
       (goto-char (point-min))
       (org-element-context))
   #+end_src

   #+RESULTS:
   | keyword | (:key TITLE :value Org Element Api :begin 1 :end 26 :post-blank 0 :post-affiliated 1 :parent nil) |

** Examining Element

   #+begin_src emacs-lisp
     (org-element-type (org-element-at-point))
   #+end_src

   #+RESULTS:
   : src-block

   #+begin_src emacs-lisp
     (org-element-property :language (org-element-at-point))
   #+end_src

   #+RESULTS:
   : emacs-lisp

   Note: You can't use =org-element-contents= with local parsing.

   #+begin_src emacs-lisp
     (org-element-contents (org-element-at-point))
   #+end_src

   #+RESULTS:

