docs/notes/emacs/org_element_api.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Element Api</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Org Element Api</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8e1634c">Local Parsing</a>
<ul>
<li><a href="#org2d248a3">org-element-at-point</a></li>
<li><a href="#org6f892db">org-element-context</a></li>
<li><a href="#org3953ad4">Examining Element</a></li>
</ul>
</li>
<li><a href="#org08e3cc3">Global Parsing</a>
<ul>
<li><a href="#org4ff16ac">Accessors</a></li>
</ul>
</li>
<li><a href="#org6a25075">Foo</a></li>
</ul>
</div>
</nav>
<p>
Good doc here: <a href="https://orgmode.org/worg/dev/org-element-api.html">https://orgmode.org/worg/dev/org-element-api.html</a>
</p>

<div id="outline-container-org8e1634c" class="outline-2">
<h2 id="org8e1634c"><a href="#org8e1634c">Local Parsing</a></h2>
<div class="outline-text-2" id="text-org8e1634c">
<p>
Local parsing gives information about the element at point. Local parsing
gives you information, but you cannot alter the structure of the AST.
</p>

<p>
Two functions you can use:
</p>

<ol class="org-ol">
<li><code>org-element-at-point</code></li>
<li><code>org-element-context</code></li>
</ol>
</div>

<div id="outline-container-org2d248a3" class="outline-3">
<h3 id="org2d248a3"><a href="#org2d248a3">org-element-at-point</a></h3>
<div class="outline-text-3" id="text-org2d248a3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>pp <span style="color: #c678dd;">(</span>org-element-at-point<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
(src-block
 (:language "emacs-lisp" :switches nil :parameters nil :begin 399 :end 472 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "     (pp (org-element-at-point))\n" :post-blank 1 :post-affiliated 399 :parent nil))
</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>pp <span style="color: #c678dd;">(</span><span style="color: #51afef;">save-excursion</span>
   <span style="color: #98be65;">(</span>goto-char <span style="color: #a9a1e1;">(</span>point-min<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span>org-element-at-point<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
(keyword
 (:key "TITLE" :value "Org Element Api" :begin 1 :end 26 :post-blank 0 :post-affiliated 1 :parent nil))
</pre>
</div>
</div>

<div id="outline-container-org6f892db" class="outline-3">
<h3 id="org6f892db"><a href="#org6f892db">org-element-context</a></h3>
<div class="outline-text-3" id="text-org6f892db">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>org-element-context<span style="color: #51afef;">)</span>
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">src-block</td>
<td class="org-left">(:language emacs-lisp :switches nil :parameters nil :begin 958 :end 1025 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value      (org-element-context)</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">save-excursion</span>
  <span style="color: #c678dd;">(</span>goto-char <span style="color: #98be65;">(</span>point-min<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>org-element-context<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">keyword</td>
<td class="org-left">(:key TITLE :value Org Element Api :begin 1 :end 26 :post-blank 0 :post-affiliated 1 :parent nil)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3953ad4" class="outline-3">
<h3 id="org3953ad4"><a href="#org3953ad4">Examining Element</a></h3>
<div class="outline-text-3" id="text-org3953ad4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>org-element-type <span style="color: #c678dd;">(</span>org-element-at-point<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
src-block
</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>org-element-property <span style="color: #c678dd;">:language</span> <span style="color: #c678dd;">(</span>org-element-at-point<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
emacs-lisp
</pre>


<p>
Note: You can't use <code>org-element-contents</code> with local parsing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>org-element-contents <span style="color: #c678dd;">(</span>org-element-at-point<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
