docs/notes/emacs/org_element_api.html

<div id="outline-container-org08e3cc3" class="outline-2">
<h2 id="org08e3cc3"><a href="#org08e3cc3">Global Parsing</a></h2>
<div class="outline-text-2" id="text-org08e3cc3">
<p>
Use <code>org-element-parse-buffer</code> to return a full AST of the buffer. You may
modify this AST using setters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>org-element-parse-buffer <span style="color: #c678dd;">(</span>current-buffer<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">org-data</td>
<td class="org-left">nil</td>
<td class="org-left">(section (:begin 1 :end 139 :contents-begin 1 :contents-end 138 :post-blank 1 :post-affiliated 1 :parent (org-data nil #0 (headline (:raw-value Local Parsing :begin 139 :end 2059 :pre-blank 1 :contents-begin 156 :contents-end 2058 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 139 :title Local Parsing :parent #2) (section (:begin 156 :end 391 :contents-begin 156 :contents-end 390 :post-blank 1 :post-affiliated 156 :parent #3)) (headline (:raw-value org-element-at-point :begin 391 :end 1046 :pre-blank 1 :contents-begin 416 :contents-end 1045 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 391 :title org-element-at-point :parent #3) (section (:begin 416 :end 1046 :contents-begin 416 :contents-end 1045 :post-blank 1 :post-affiliated 416 :parent #4))) (headline (:raw-value org-element-context :begin 1046 :end 1615 :pre-blank 1 :contents-begin 1070 :contents-end 1614 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1046 :title org-element-context :parent #3) (section (:begin 1070 :end 1615 :contents-begin 1070 :contents-end 1614 :post-blank 1 :post-affiliated 1070 :parent #4))) (headline (:raw-value Examining Element :begin 1615 :end 2058 :pre-blank 1 :contents-begin 1637 :contents-end 2058 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1615 :title Examining Element :parent #3) (section (:begin 1637 :end 2059 :contents-begin 1637 :contents-end 2058 :post-blank 1 :post-affiliated 1637 :parent #4)))) (headline (:raw-value Global Parsing :begin 2059 :end 64710 :pre-blank 1 :contents-begin 2077 :contents-end 64709 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2059 :title Global Parsing :parent #2) (section (:begin 2077 :end 2274 :contents-begin 2077 :contents-end 2273 :post-blank 1 :post-affiliated 2077 :parent #3)) (headline (:raw-value Accessors :begin 2274 :end 64709 :pre-blank 1 :contents-begin 2288 :contents-end 64709 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2274 :title Accessors :parent #3) (section (:begin 2288 :end 64710 :contents-begin 2288 :contents-end 64709 :post-blank 1 :post-affiliated 2288 :parent #4)))) (headline (:raw-value Foo :begin 64710 :end 64823 :pre-blank 1 :contents-begin 64717 :contents-end 64823 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 64710 :title Foo :parent #2) (section (:begin 64717 :end 64823 :contents-begin 64717 :contents-end 64823 :post-blank 0 :post-affiliated 64717 :parent #3))))))</td>
<td class="org-left">(headline (:raw-value Local Parsing :begin 139 :end 2059 :pre-blank 1 :contents-begin 156 :contents-end 2058 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 139 :title Local Parsing :parent (org-data nil (section (:begin 1 :end 139 :contents-begin 1 :contents-end 138 :post-blank 1 :post-affiliated 1 :parent #2)) #0 (headline (:raw-value Global Parsing :begin 2059 :end 64710 :pre-blank 1 :contents-begin 2077 :contents-end 64709 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2059 :title Global Parsing :parent #2) (section (:begin 2077 :end 2274 :contents-begin 2077 :contents-end 2273 :post-blank 1 :post-affiliated 2077 :parent #3)) (headline (:raw-value Accessors :begin 2274 :end 64709 :pre-blank 1 :contents-begin 2288 :contents-end 64709 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2274 :title Accessors :parent #3) (section (:begin 2288 :end 64710 :contents-begin 2288 :contents-end 64709 :post-blank 1 :post-affiliated 2288 :parent #4)))) (headline (:raw-value Foo :begin 64710 :end 64823 :pre-blank 1 :contents-begin 64717 :contents-end 64823 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 64710 :title Foo :parent #2) (section (:begin 64717 :end 64823 :contents-begin 64717 :contents-end 64823 :post-blank 0 :post-affiliated 64717 :parent #3))))) (section (:begin 156 :end 391 :contents-begin 156 :contents-end 390 :post-blank 1 :post-affiliated 156 :parent #0)) (headline (:raw-value org-element-at-point :begin 391 :end 1046 :pre-blank 1 :contents-begin 416 :contents-end 1045 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 391 :title org-element-at-point :parent #0) (section (:begin 416 :end 1046 :contents-begin 416 :contents-end 1045 :post-blank 1 :post-affiliated 416 :parent #1))) (headline (:raw-value org-element-context :begin 1046 :end 1615 :pre-blank 1 :contents-begin 1070 :contents-end 1614 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1046 :title org-element-context :parent #0) (section (:begin 1070 :end 1615 :contents-begin 1070 :contents-end 1614 :post-blank 1 :post-affiliated 1070 :parent #1))) (headline (:raw-value Examining Element :begin 1615 :end 2058 :pre-blank 1 :contents-begin 1637 :contents-end 2058 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1615 :title Examining Element :parent #0) (section (:begin 1637 :end 2059 :contents-begin 1637 :contents-end 2058 :post-blank 1 :post-affiliated 1637 :parent #1))))</td>
<td class="org-left">(headline (:raw-value Global Parsing :begin 2059 :end 64710 :pre-blank 1 :contents-begin 2077 :contents-end 64709 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2059 :title Global Parsing :parent (org-data nil (section (:begin 1 :end 139 :contents-begin 1 :contents-end 138 :post-blank 1 :post-affiliated 1 :parent #2)) (headline (:raw-value Local Parsing :begin 139 :end 2059 :pre-blank 1 :contents-begin 156 :contents-end 2058 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 139 :title Local Parsing :parent #2) (section (:begin 156 :end 391 :contents-begin 156 :contents-end 390 :post-blank 1 :post-affiliated 156 :parent #3)) (headline (:raw-value org-element-at-point :begin 391 :end 1046 :pre-blank 1 :contents-begin 416 :contents-end 1045 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 391 :title org-element-at-point :parent #3) (section (:begin 416 :end 1046 :contents-begin 416 :contents-end 1045 :post-blank 1 :post-affiliated 416 :parent #4))) (headline (:raw-value org-element-context :begin 1046 :end 1615 :pre-blank 1 :contents-begin 1070 :contents-end 1614 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1046 :title org-element-context :parent #3) (section (:begin 1070 :end 1615 :contents-begin 1070 :contents-end 1614 :post-blank 1 :post-affiliated 1070 :parent #4))) (headline (:raw-value Examining Element :begin 1615 :end 2058 :pre-blank 1 :contents-begin 1637 :contents-end 2058 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1615 :title Examining Element :parent #3) (section (:begin 1637 :end 2059 :contents-begin 1637 :contents-end 2058 :post-blank 1 :post-affiliated 1637 :parent #4)))) #0 (headline (:raw-value Foo :begin 64710 :end 64823 :pre-blank 1 :contents-begin 64717 :contents-end 64823 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 64710 :title Foo :parent #2) (section (:begin 64717 :end 64823 :contents-begin 64717 :contents-end 64823 :post-blank 0 :post-affiliated 64717 :parent #3))))) (section (:begin 2077 :end 2274 :contents-begin 2077 :contents-end 2273 :post-blank 1 :post-affiliated 2077 :parent #0)) (headline (:raw-value Accessors :begin 2274 :end 64709 :pre-blank 1 :contents-begin 2288 :contents-end 64709 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2274 :title Accessors :parent #0) (section (:begin 2288 :end 64710 :contents-begin 2288 :contents-end 64709 :post-blank 1 :post-affiliated 2288 :parent #1))))</td>
<td class="org-left">(headline (:raw-value Foo :begin 64710 :end 64823 :pre-blank 1 :contents-begin 64717 :contents-end 64823 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 64710 :title Foo :parent (org-data nil (section (:begin 1 :end 139 :contents-begin 1 :contents-end 138 :post-blank 1 :post-affiliated 1 :parent #2)) (headline (:raw-value Local Parsing :begin 139 :end 2059 :pre-blank 1 :contents-begin 156 :contents-end 2058 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 139 :title Local Parsing :parent #2) (section (:begin 156 :end 391 :contents-begin 156 :contents-end 390 :post-blank 1 :post-affiliated 156 :parent #3)) (headline (:raw-value org-element-at-point :begin 391 :end 1046 :pre-blank 1 :contents-begin 416 :contents-end 1045 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 391 :title org-element-at-point :parent #3) (section (:begin 416 :end 1046 :contents-begin 416 :contents-end 1045 :post-blank 1 :post-affiliated 416 :parent #4))) (headline (:raw-value org-element-context :begin 1046 :end 1615 :pre-blank 1 :contents-begin 1070 :contents-end 1614 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1046 :title org-element-context :parent #3) (section (:begin 1070 :end 1615 :contents-begin 1070 :contents-end 1614 :post-blank 1 :post-affiliated 1070 :parent #4))) (headline (:raw-value Examining Element :begin 1615 :end 2058 :pre-blank 1 :contents-begin 1637 :contents-end 2058 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1615 :title Examining Element :parent #3) (section (:begin 1637 :end 2059 :contents-begin 1637 :contents-end 2058 :post-blank 1 :post-affiliated 1637 :parent #4)))) (headline (:raw-value Global Parsing :begin 2059 :end 64710 :pre-blank 1 :contents-begin 2077 :contents-end 64709 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2059 :title Global Parsing :parent #2) (section (:begin 2077 :end 2274 :contents-begin 2077 :contents-end 2273 :post-blank 1 :post-affiliated 2077 :parent #3)) (headline (:raw-value Accessors :begin 2274 :end 64709 :pre-blank 1 :contents-begin 2288 :contents-end 64709 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2274 :title Accessors :parent #3) (section (:begin 2288 :end 64710 :contents-begin 2288 :contents-end 64709 :post-blank 1 :post-affiliated 2288 :parent #4)))) #0)) (section (:begin 64717 :end 64823 :contents-begin 64717 :contents-end 64823 :post-blank 0 :post-affiliated 64717 :parent #0)))</td>
</tr>
</tbody>
</table>
</div>
