docs/notes/emacs/org_element_api.html

<div id="outline-container-org4ff16ac" class="outline-3">
<h3 id="org4ff16ac"><a href="#org4ff16ac">Accessors</a></h3>
<div class="outline-text-3" id="text-org4ff16ac">
<p>
Three functions:
</p>

<ol class="org-ol">
<li><code>org-element-type</code></li>
<li><code>org-element-property</code></li>
<li><code>org-element-contents</code></li>
</ol>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>org-element-contents
 <span style="color: #c678dd;">(</span>org-element-parse-buffer <span style="color: #98be65;">(</span>current-buffer<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">section</td>
<td class="org-left">(:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent (org-data nil (section #0) (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent #1) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #2)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #2) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #3))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #2) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #3))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #2) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #3)))) (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #1) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #2)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #2) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #3)))) (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #1) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #2)))))</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">headline</td>
<td class="org-left">(:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #1)) (headline #0 (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #2)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #2) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #3))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #2) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #3))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #2) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #3)))) (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #1) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #2)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #2) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #3)))) (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #1) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #2)))))</td>
<td class="org-left">(section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #4)) #2 (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #4) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #5)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #5) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #6)))) (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #4) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #5))))) #0 (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #2) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #3))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #2) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #3))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #2) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #3))))))</td>
<td class="org-left">(headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #4)) #2 (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #4) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #5)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #5) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #6)))) (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #4) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #5))))) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #2)) #0 (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #2) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #3))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #2) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #3))))) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #0)))</td>
<td class="org-left">(headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #4)) #2 (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #4) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #5)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #5) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #6)))) (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #4) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #5))))) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #2)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #2) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #3))) #0 (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #2) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #3))))) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #0)))</td>
<td class="org-left">(headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #4)) #2 (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #4) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #5)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #5) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #6)))) (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #4) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #5))))) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #2)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #2) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #3))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #2) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #3))) #0)) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #0)))</td>
</tr>

<tr>
<td class="org-left">headline</td>
<td class="org-left">(:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #1)) (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent #1) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #2)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #2) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #3))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #2) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #3))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #2) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #3)))) (headline #0 (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #2)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #2) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #3)))) (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #1) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #2)))))</td>
<td class="org-left">(section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #4)) (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent #4) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #5)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #5) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #6))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #5) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #6))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #5) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #6)))) #2 (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #4) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #5))))) #0 (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #2) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #3))))))</td>
<td class="org-left">(headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #4)) (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent #4) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #5)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #5) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #6))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #5) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #6))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #5) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #6)))) #2 (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent #4) (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #5))))) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #2)) #0)) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #0)))</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">headline</td>
<td class="org-left">(:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #1)) (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent #1) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #2)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #2) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #3))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #2) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #3))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #2) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #3)))) (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #1) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #2)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #2) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #3)))) (headline #0 (section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent #2)))))</td>
<td class="org-left">(section (:begin 11329 :end 11435 :contents-begin 11329 :contents-end 11435 :post-blank 0 :post-affiliated 11329 :parent (headline (:raw-value Foo :begin 11322 :end 11435 :pre-blank 1 :contents-begin 11329 :contents-end 11435 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11322 :title Foo :parent (org-data nil (section (:begin 1 :end 122 :contents-begin 1 :contents-end 121 :post-blank 1 :post-affiliated 1 :parent #4)) (headline (:raw-value Local Parsing :begin 122 :end 2042 :pre-blank 1 :contents-begin 139 :contents-end 2041 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 122 :title Local Parsing :parent #4) (section (:begin 139 :end 374 :contents-begin 139 :contents-end 373 :post-blank 1 :post-affiliated 139 :parent #5)) (headline (:raw-value org-element-at-point :begin 374 :end 1029 :pre-blank 1 :contents-begin 399 :contents-end 1028 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 374 :title org-element-at-point :parent #5) (section (:begin 399 :end 1029 :contents-begin 399 :contents-end 1028 :post-blank 1 :post-affiliated 399 :parent #6))) (headline (:raw-value org-element-context :begin 1029 :end 1598 :pre-blank 1 :contents-begin 1053 :contents-end 1597 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1029 :title org-element-context :parent #5) (section (:begin 1053 :end 1598 :contents-begin 1053 :contents-end 1597 :post-blank 1 :post-affiliated 1053 :parent #6))) (headline (:raw-value Examining Element :begin 1598 :end 2041 :pre-blank 1 :contents-begin 1620 :contents-end 2041 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 1598 :title Examining Element :parent #5) (section (:begin 1620 :end 2042 :contents-begin 1620 :contents-end 2041 :post-blank 1 :post-affiliated 1620 :parent #6)))) (headline (:raw-value Global Parsing :begin 2042 :end 11322 :pre-blank 1 :contents-begin 2060 :contents-end 11321 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 2042 :title Global Parsing :parent #4) (section (:begin 2060 :end 11196 :contents-begin 2060 :contents-end 11195 :post-blank 1 :post-affiliated 2060 :parent #5)) (headline (:raw-value Accessors :begin 11196 :end 11321 :pre-blank 1 :contents-begin 11210 :contents-end 11321 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 11196 :title Accessors :parent #5) (section (:begin 11210 :end 11322 :contents-begin 11210 :contents-end 11321 :post-blank 1 :post-affiliated 11210 :parent #6)))) #2)) #0)))</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
