notes/org/emacs/org_element_api.org
* Foo

  #+begin_src emacs-lisp
    (with-temp-buffer
      (insert-buffer (current-buffer))
      )
  #+end_src
