docs/notes/emacs/org_element_api.html

<div id="outline-container-org6a25075" class="outline-2">
<h2 id="org6a25075"><a href="#org6a25075">Foo</a></h2>
<div class="outline-text-2" id="text-org6a25075">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">with-temp-buffer</span>
  <span style="color: #c678dd;">(</span>insert-buffer <span style="color: #98be65;">(</span>current-buffer<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
